// Обработка создания, проверки и удаления предопределенных настроек для подсистемы ПредопределенныеЗначения.

// Процедура выполняется при создании формы на сервере.
// Параметры:
// - Отказ - логическое значение, указывающее на отмену действия. Если в процедуре установлено Истина, то стандартное действие будет прервано.
// - СтандартнаяОбработка - логическое значение, если Истина, то выполнится стандартная обработка события.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПовторноИспользуемыеЗначения();
	ПроверитьСозданныеНастройки();
	ОбновитьПовторноИспользуемыеЗначения();
	ПроверитьУдаленныеНастройки();
	
КонецПроцедуры

#Область ОбработчикиКомандФормы


// Процедура вызывается при выполнении команды создания предопределенных настроек.
// Параметры:
// - Команда - объект, представляющий команду.
&НаКлиенте
Процедура СозданиеПредопределенныхНастроек(Команда)

    СозданиеПредопределенныхНастроекНаСервере();

КонецПроцедуры

// Процедура вызывается при выполнении команды удаления предопределенных настроек.
// Параметры:
// - Команда - объект, представляющий команду.
&НаКлиенте
Процедура УдалениеПредопределенныхНастроек(Команда)

	ОбновитьПовторноИспользуемыеЗначения();
    УдалениеПредопределенныхНастроекНаСервере();
    ОбновитьПовторноИспользуемыеЗначения();
    ПроверитьУдаленныеНастройки();
    
КонецПроцедуры

#КонецОбласти

#Область СерверныеМетоды

// Процедура выполняет создание предопределенных настроек на сервере.
&НаСервере
Процедура СозданиеПредопределенныхНастроекНаСервере()


    ОбновитьПовторноИспользуемыеЗначения();
		ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();
    ПредопределенныеНастройки.ЗаполнениеПредопределенныхЭлементов(ТаблицаНастроек);
КонецПроцедуры

// Функция возвращает таблицу предопределенных тестовых настроек.
// Возвращаемое значение:
// ТаблицаЗначений - ТаблицаЗначений, содержащая информацию о предопределенных тестовых настройках.
&НаСервере
Функция ТаблицаПредопределенныхТестовыхНастроек()

    ТаблицаНастроек = ПредопределенныеНастройки.ТаблицаПредопределенныхНастроек();
    НоваяНастройка = ТаблицаНастроек.Добавить();
    НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("2f205348-2c73-46a8-98a6-851a40a12bbe");
    НоваяНастройка.ИмяНастройки = "ТестированиеСтроковогоЗначения";
    НоваяНастройка.ЗначениеПараметров = "Строковое значение";
    Возврат ТаблицаНастроек;

КонецФункции

// Процедура проверяет, были ли созданы предопределенные настройки.
&НаСервере
Процедура ПроверитьСозданныеНастройки()

    НастройкиНайдены = Истина;
    ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();
    
    Для Каждого Строка Из ТаблицаНастроек Цикл
        Настройка = ПредопределенныеНастройкиПовтИсп.СсылкаПредопределеннойНастройки(Строка.ИмяНастройки);
        Если Настройка = ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка") Тогда
            НастройкиНайдены = Ложь;
        КонецЕсли;
    КонецЦикла;

    Если НастройкиНайдены Тогда 
        Элементы.НастройкиСозданы.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
        Элементы.НастройкиСозданы.Подсказка = НСтр("ru ='Тестовые настройки созданы'");
    Иначе
        Элементы.НастройкиСозданы.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
        Элементы.НастройкиСозданы.Подсказка = НСтр("ru ='Тестовые настройки не найдены'");
    КонецЕсли;

КонецПроцедуры

// Процедура удаляет предопределенные настройки с сервера.
&НаСервере
Процедура УдалениеПредопределенныхНастроекНаСервере()

    ОбновитьПовторноИспользуемыеЗначения();
    ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();

    Для Каждого Строка Из ТаблицаНастроек Цикл
        Настройка = ПредопределенныеНастройкиПовтИсп.СсылкаПредопределеннойНастройки(Строка.ИмяНастройки);
        Если ЗначениеЗаполнено(Настройка) И ТипЗнч(Настройка) = Тип("СправочникСсылка.ПредопределенныеНастройки") Тогда
            ОбъектНастройки = Настройка.ПолучитьОбъект();
            ОбъектНастройки.Удалить();
        КонецЕсли;
    КонецЦикла;

КонецПроцедуры

// Процедура проверяет, были ли удалены предопределенные настройки.
&НаСервере
Процедура ПроверитьУдаленныеНастройки()

    НастройкиУдалены = Истина;
    ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();

    Для Каждого Строка Из ТаблицаНастроек Цикл
        Настройка = ПредопределенныеНастройки.Значение(Строка.ИмяНастройки);
        Если Настройка <> ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка") Тогда
            НастройкиУдалены = Ложь;
        КонецЕсли;
    КонецЦикла;

    Если НастройкиУдалены Тогда 
        Элементы.НастройкиУдалены.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
        Элементы.НастройкиУдалены.Подсказка = НСтр("ru ='Тестовые настройки не обнаружены'");
    Иначе
        Элементы.НастройкиУдалены.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
        Элементы.НастройкиУдалены.Подсказка = НСтр("ru ='Тестовые настройки найдены в базе'");
    КонецЕсли;

КонецПроцедуры
#КонецОбласти