
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПовторноИспользуемыеЗначения();
	ПроверитьСозданныеНастройки();
	
	ОбновитьПовторноИспользуемыеЗначения();
	ПроверитьУдаленныеНастройки();
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СозданиеПредопределенныхНастроек(Команда)
	СозданиеПредопределенныхНастроекНаСервере();
КонецПроцедуры

&НаСервере
Процедура СозданиеПредопределенныхНастроекНаСервере()
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();
	
	ОбновитьПовторноИспользуемыеЗначения();
	ПредопределенныеНастройки.ЗаполнениеПредопределенныхЭлементов(ТаблицаНастроек);

КонецПроцедуры

&НаСервере
Процедура ПроверитьСозданныеНастройки()
	
	НастройкиНайдены = Истина;
	
	ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();
	
	Для Каждого Строка Из ТаблицаНастроек Цикл
		
		Настройка = ПредопределенныеНастройкиПовтИсп.СсылкаПредопределеннойНастройки(Строка.ИмяНастройки);
		Если Настройка = ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка") Тогда
			НастройкиНайдены = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если НастройкиНайдены Тогда 
		Элементы.НастройкиСозданы.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
		Элементы.НастройкиСозданы.Подсказка = НСтр("ru ='Тестовые настройки не найдены'");
	Иначе
		Элементы.НастройкиСозданы.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
		Элементы.НастройкиСозданы.Подсказка = НСтр("ru ='Тестовые настройки созданы'");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ТаблицаПредопределенныхТестовыхНастроек()

	ТаблицаНастроек = ПредопределенныеНастройки.ТаблицаПредопределенныхНастроек();
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("2f205348-2c73-46a8-98a6-851a40a12bbe");
	НоваяНастройка.ИмяНастройки = "ТестированиеСтроковогоЗначения";
	НоваяНастройка.ЗначенияПараметров = "Строковое значение";
	Возврат ТаблицаНастроек;
	
КонецФункции


&НаКлиенте
Процедура УдалениеПредопределенныхНастроек(Команда)
	
	ОбновитьПовторноИспользуемыеЗначения();
	УдалениеПредопределенныхНастроекНаСервере();
	
	ОбновитьПовторноИспользуемыеЗначения();
	ПроверитьУдаленныеНастройки();
	
КонецПроцедуры
#КонецОбласти
&НаСервере
Процедура УдалениеПредопределенныхНастроекНаСервере()
	ОбновитьПовторноИспользуемыеЗначения();
	ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();
	%;
	Для Каждого Строка Из ТаблицаНастроек Цикл
		
		Настройка = ПредопределенныеНастройкиПовтИсп.СсылкаПредопределеннойНастройки(Строка.ИмяНастройки);
		Если ЗначениеЗаполнено(Настройка)
		 И ТипЗнч(Настройка) = Тип("СправочникСсылка.ПредопределенныеНастройки") Тогда
			ОбъектНастройки = Настройка.ПолучитьОбъект();
			ОбъектНастройки.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьУдаленныеНастройки()
	
		НастройкиУдалены = Истина;
		ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();
	Для Каждого Строка Из ТаблицаНастроек Цикл
		
		Настройка = ПредопределенныеНастройки.Значение(Строка.ИмяНастройки);
		Если Настройка <> ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка") Тогда
			НастройкиУдалены = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если НастройкиУдалены Тогда 
		Элементы.НастройкиУдалены.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
		Элементы.НастройкиУдалены.Подсказка = НСтр("ru ='Тестовые настройки не обнаружены'");
	Иначе
		Элементы.НастройкиУдалены.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
		Элементы.НастройкиУдалены.Подсказка = НСтр("ru ='Тестовые настройки найдены в базе'");
	КонецЕсли;	
	
КонецПроцедуры