
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СозданиеПредопределенныхНастроек(Команда)
	СозданиеПредопределенныхНастроекНаСервере();
КонецПроцедуры

&НаСервере
Процедура СозданиеПредопределенныхНастроекНаСервере()
	
	ТаблицаНастроек = ПредопределенныеНастройки.ТаблицаПредопределенныхНастроек();
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("2f205348-2c73-46a8-98a6-851a40a12bbe");
	НоваяНастройка.ИмяНастройки = "ТестированиеСтроковогоЗначения";
	НоваяНастройка.ЗначенияПараметров = "Строковое значение";
	
	ПредопределенныеНастройки.ЗаполнениеПредопределенныхЭлементов(ТаблицаНастроек);

КонецПроцедуры

#КонецОбласти
