// Обработка создания, проверки и удаления предопределенных настроек для подсистемы ПредопределенныеЗначения.
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьНачальныеСтатусыПроверок();

КонецПроцедуры

Процедура ПриОткрытии()
	// Код обработчика
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СозданиеПредопределенныхНастроек(Команда)

	СозданиеПредопределенныхНастроекНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура УдалениеПредопределенныхНастроек(Команда)

	ОбновитьПовторноИспользуемыеЗначения();
	УдалениеПредопределенныхНастроекНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПроверитьУдаленныеНастройки();

КонецПроцедуры

&НаКлиенте
Процедура СозданиеПредопределеннойНастройкиСтрока(Команда)
	СозданиеПредопределеннойНастройкиСтрокаНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура УстановитьЗначениеПредопределеннойНастройкиСтрока(Команда)
	УстановитьЗначениеПредопределеннойНастройкиСтрокаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПредопределеннойНастройкиСтрока(Команда)
	УдалениеПредопределеннойНастройкиСтрокаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СозданиеПредопределеннойНастройкиБулево(Команда)
	СозданиеПредопределеннойНастройкиБулевоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПредопределеннойНастройкиБулево(Команда)
	УстановитьЗначениеПредопределеннойНастройкиБулевоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПредопределеннойНастройкиБулево(Команда)
	УдалениеПредопределеннойНастройкиБулевоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СозданиеПредопределеннойНастройкиСсылка(Команда)
	СозданиеПредопределеннойНастройкиСсылкаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПредопределеннойНастройкиСсылка(Команда)
	УстановитьЗначениеПредопределеннойНастройкиСсылкаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПредопределеннойНастройкиСсылка(Команда)
	УдалениеПредопределеннойНастройкиСсылкаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СозданиеПредопределеннойНастройкМассив(Команда)
	СозданиеПредопределеннойНастройкМассивНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПредопределеннойНастройкиМассив(Команда)
	УстановитьЗначениеПредопределеннойНастройкиМассивНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПредопределеннойНастройкиМассив(Команда)
	УдалениеПредопределеннойНастройкиМассивНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СозданиеПредопределеннойНастройкиКлючЗначение(Команда)
	СозданиеПредопределеннойНастройкиКлючЗначениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПредопределеннойНастройкиКлючЗначение(Команда)
	УдалениеПредопределеннойНастройкиКлючЗначениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПредопределеннойНастройкиКлючЗначение(Команда)
	УстановитьЗначениеПредопределеннойНастройкиКлючЗначениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СозданиеПредопределеннойНастройкиТаблицаЗначений(Команда)
	СозданиеПредопределеннойНастройкиТаблицаЗначенийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПредопределеннойНастройкиТаблицаЗначений(Команда)
	УстановитьЗначениеПредопределеннойНастройкиТаблицаЗначенийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПредопределеннойНастройкиТаблицаЗначений(Команда)
	УдалениеПредопределеннойНастройкиТаблицаЗначенийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТестовые(Команда)
	УстановитьТестовыеНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет создание предопределенных настроек на сервере.
&НаСервере
Процедура СозданиеПредопределенныхНастроекНаСервере()

	ОбновитьПовторноИспользуемыеЗначения();
	
	ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);
	ПроверитьСозданныеНастройки(ТаблицаНастроек);

КонецПроцедуры

&НаСервере
Процедура УстановитьТестовыеНаСервере()
	
	ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ДобавитьТестовоеБулево(ТаблицаНастроек);
	ТаблицаНастроек[0].Значение = Не ТаблицаНастроек[0].Значение;
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ПредопределеннаяНастройка = ПредопределенныеНастройки.НастройкаПоИмени(ИмяНастройкиТестовогоБулево());
	ЗначениеПредопределеннойНастройки = ПредопределенныеНастройки.Значение(ИмяНастройкиТестовогоБулево(), Истина);

КонецПроцедуры

// Функция возвращает таблицу предопределенных тестовых настроек.
// Возвращаемое значение:
// ТаблицаЗначений - ТаблицаЗначений, содержащая информацию о предопределенных тестовых настройках.
&НаСервере
Функция ТаблицаПредопределенныхТестовыхНастроек()

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();

	ДобавитьТестовуюСтроку(ТаблицаНастроек);
	ДобавитьТестовоеБулево(ТаблицаНастроек);
	ДобавитьТестовуюСсылку(ТаблицаНастроек);
	ДобавитьТестовыйМассив(ТаблицаНастроек);
	ДобавитьТестовыйКлючЗначение(ТаблицаНастроек);
	ДобавитьТестовуюТаблицуЗначений(ТаблицаНастроек);

	Возврат ТаблицаНастроек;

КонецФункции

// Процедура проверяет, были ли созданы предопределенные настройки.
&НаСервере
Процедура ПроверитьСозданныеНастройки(ТаблицаНастроек)

	ИменаКнопокПоТипуНастроек = ИменаКнопокСозданияПоТипамЗначений();

	НастройкиНайдены = Истина;

	Для Каждого Строка Из ТаблицаНастроек Цикл
		Настройка = ПредопределенныеНастройкиПовтИсп.СсылкаПредопределеннойНастройки(Строка.ИмяНастройки);
		
		ИмяКнопки = ИменаКнопокПоТипуНастроек[Строка.ТипЗначения];
		Кнопка = Элементы[ИмяКнопки];
		Кнопка.Картинка = БиблиотекаКартинок.ОформлениеКругЖелтый;
		Кнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
		Кнопка.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		
		Команда = Команды[ИмяКнопки];
		
		ДобавитьПодсказку(Команда, НСтр("ru = 'Настройка создана'"));	

		// Проверка установленных значений
		Если Строка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Строка")
			Или Строка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Булево")
			Или Строка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Ссылка") Тогда
			
			Если Строка.Значение = ПредопределенныеНастройки.Значение(Строка.ИмяНастройки) Тогда
				Кнопка.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
				ДобавитьПодсказку(Команда, НСтр("ru = 'Значение настройки проверено'"));
			Иначе
				Кнопка.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
				ДобавитьПодсказку(Команда, НСтр("ru = 'Значение настройки не совпадает'"));
			КонецЕсли;
			
		ИначеЕсли Строка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Массив") Тогда 
			
			Если МассивыИдентичны(Строка.Значение, ПредопределенныеНастройки.Значение(Строка.ИмяНастройки)) Тогда
				Кнопка.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
				ДобавитьПодсказку(Команда, НСтр("ru = 'Значение настройки проверено'"));
			Иначе 
				Кнопка.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
				ДобавитьПодсказку(Команда, НСтр("ru = 'Значение настройки не корректно'"));
			КонецЕсли;
			
		ИначеЕсли Строка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.ТаблицаЗначений")
			Или Строка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.КлючЗначение") Тогда 
			
			Если Не КоллекцияРазличаются(Строка.Значение, ПредопределенныеНастройки.Значение(Строка.ИмяНастройки)) Тогда
				Кнопка.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
				ДобавитьПодсказку(Команда, НСтр("ru = 'Значение настройки проверено'"));
			Иначе
				Кнопка.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
				ДобавитьПодсказку(Команда, НСтр("ru = 'Значение настройки не корректно'"));
			КонецЕсли;
	
			
		КонецЕсли;
		
		Если Настройка = ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка") Тогда
			НастройкиНайдены = Ложь;
		КонецЕсли;
	КонецЦикла;

	Если НастройкиНайдены Тогда
		Элементы.НастройкиСозданы.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
		Элементы.НастройкиСозданы.Подсказка = НСтр("ru ='Тестовые настройки созданы'");
	Иначе
		Элементы.НастройкиСозданы.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
		Элементы.НастройкиСозданы.Подсказка = НСтр("ru ='Тестовые настройки не найдены'");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция МассивыИдентичны(ПервыйМассив, ВторойМассив) 
	ЭлементовМассива = ПервыйМассив.Количество();
	МассивыСовпадают = (ЭлементовМассива = ВторойМассив.Количество());
	Если МассивыСовпадают Тогда
		Для Сч = 1 По ЭлементовМассива Цикл
			Если ПервыйМассив[Сч - 1] <> ВторойМассив[Сч - 1] Тогда
				Возврат Ложь
			КонецЕсли
			;
		КонецЦикла;
	КонецЕсли;
	Возврат МассивыСовпадают
КонецФункции

&НаСервере
Функция КоллекцияРазличаются(ТЗ1,ТЗ2,ИсключаемыеКолонки="")

    ИсклКол = СтрРазделить(ИсключаемыеКолонки, ",", Ложь);

    Если ТЗ1.Количество()<>ТЗ2.Количество() Тогда
        Если ТЗ1.Количество()=1 И ТЗ2.Количество()=0 Тогда
            Для К=0 По ТЗ1.Количество()-1 Цикл
                Стр1=ТЗ1[К];
                Для М=0 По ТЗ1.Колонки.Количество()-1 Цикл
                    Имя=ТЗ1.Колонки[М].Имя;
                    Если ИсклКол.Найти(Имя)<>Неопределено Тогда
                        Продолжить;
                    КонецЕсли;
                    Если ЗначениеЗаполнено(Стр1[Имя]) Тогда
                        Возврат Истина;
                    КонецЕсли;
                КонецЦикла;
            КонецЦикла;
            Возврат Ложь;
        ИначеЕсли ТЗ1.Количество()=0 И ТЗ2.Количество()=1 Тогда
            Для К=0 По ТЗ2.Количество()-1 Цикл
                Стр2=ТЗ2[К];
                Для М=0 По ТЗ1.Колонки.Количество()-1 Цикл
                    Имя=ТЗ1.Колонки[М].Имя;
                    Если ИсклКол.Найти(Имя)<>Неопределено Тогда
                        Продолжить;
                    КонецЕсли;
                    Если ЗначениеЗаполнено(Стр2[Имя]) Тогда
                        Возврат Истина;
                    КонецЕсли;
                КонецЦикла;
            КонецЦикла;
            Возврат Ложь;
        Иначе
            Возврат Истина;
        КонецЕсли;
    КонецЕсли;
    Для К=0 По ТЗ1.Количество()-1 Цикл
        Стр1=ТЗ1[К];
        Стр2=ТЗ2[К];
        Для М=0 По ТЗ1.Колонки.Количество()-1 Цикл
            Имя=ТЗ1.Колонки[М].Имя;
            Если ИсклКол.Найти(Имя)<>Неопределено Тогда
                Продолжить;
            КонецЕсли;
            Если Стр1[Имя]<>Стр2[Имя] Тогда
                Возврат Истина;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    Возврат Ложь;
КонецФункции

&НаСервере
Процедура ДобавитьПодсказку(Команда, ТекстЭтапа)
	
	Подсказка = Команда.Подсказка;
	Если ПустаяСтрока(Команда.Подсказка) Тогда
		Команда.Подсказка = ТекстЭтапа;
	Иначе
		Команда.Подсказка = СтрШаблон(НСтр("ru = '%1
			|%2'"), Подсказка, ТекстЭтапа);	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ИменаКнопокСозданияПоТипамЗначений()
	Перем ИменаКнопокПоТипуНастроек;
	ИменаКнопокПоТипуНастроек = Новый Соответствие;
	
	ИменаКнопокПоТипуНастроек.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Строка"), "СозданиеПредопределеннойНастройкиСтрока");
	ИменаКнопокПоТипуНастроек.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Булево"), "СозданиеПредопределеннойНастройкиБулево");
	ИменаКнопокПоТипуНастроек.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Ссылка"), "СозданиеПредопределеннойНастройкиСсылка");
	ИменаКнопокПоТипуНастроек.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Массив"), "СозданиеПредопределеннойНастройкиМассив");
	ИменаКнопокПоТипуНастроек.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.КлючЗначение"), "СозданиеПредопределеннойНастройкиКлючЗначение");
	ИменаКнопокПоТипуНастроек.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.ТаблицаЗначений"), "СозданиеПредопределеннойНастройкиТаблицаЗначений");
	Возврат ИменаКнопокПоТипуНастроек
КонецФункции

&НаСервере
Процедура ДобавитьТестовуюСтроку(ТаблицаНастроек)

	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("98048614-6212-466a-af5c-a08e5ca56056");
	НоваяНастройка.ИмяНастройки = ИмяНастройкиТестовойСтрки();
	НоваяНастройка.Наименование = "Насройка проверки строкового значения";
	НоваяНастройка.Описание = НСтр("ru ='Проврерка тескстовой настройки.Данная настройка создаетсяся для проверки правильности работы механизма предопределенных настроек.'");
	НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Строка");
	НоваяНастройка.Значение = НСтр("ru ='Ваше будущее - за 1С!'");

КонецПроцедуры

&НаСервере
Процедура ДобавитьТестовоеБулево(ТаблицаНастроек)

	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("bfc480f2-023e-40d3-ab52-fecb853edf3c");
	НоваяНастройка.ИмяНастройки = ИмяНастройкиТестовогоБулево();
	НоваяНастройка.Хранилище = Неопределено;
	НоваяНастройка.Наименование = НСтр("ru ='Кошки любят виноград?'");
	НоваяНастройка.Описание = НСтр("ru ='Проврерка булевой настройки. Данная настройка создаетсяся для проверки правильности работы механизма предопределенных настроек.'");
	НоваяНастройка.Значение = Истина;
	НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Булево");

КонецПроцедуры

&НаСервере
Процедура ИзменитьТестовоеБулево(ТаблицаНастроек)
	
	СуществующаяНастройка = ТаблицаНастроек.Найти(ИмяНастройкиТестовогоБулево(), "ИмяНастройки");
	Если СуществующаяНастройка <> Неопределено Тогда
		СуществующаяНастройка.Значение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьТестовуюСсылку(ТаблицаНастроек)

	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("afc120f2-645d-12d3-ab52-faab754edf3c");
	НоваяНастройка.ИмяНастройки = ИмяНастройкиТестовойСсылки();
	НоваяНастройка.Хранилище = Неопределено;
	НоваяНастройка.Наименование = НСтр("ru ='Настройка текущего релиза подсистемы'");
	НоваяНастройка.Описание = НСтр("ru ='Проврерка ссылочной настройки. Данная настройка создаетсяся для проверки правильности работы механизма предопределенных настроек.'");
	НоваяНастройка.Значение = ПредопределенныеНастройки.НастройкаПоИмени("ВерсияПодсистемы");
	НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Ссылка");

КонецПроцедуры

&НаСервере
Процедура ДобавитьТестовыйМногострочный(ТаблицаНастроек)

	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("4f205348-2c73-46a8-98a6-851a40a12bbe");
	НоваяНастройка.ИмяНастройки = "ТестМногострочный";
	НоваяНастройка.Хранилище = Перечисления.ValueStorage.Текстовый;
	НоваяНастройка.Значение = "Первая строка\r\nВторая строка";
	НоваяНастройка.Наименование = "Многострочный параметр тестовые настройки";
	НоваяНастройка.ТипЗначения = Справочники.ПредопределенныеНастройки.НайтиПоРеквизиту("ИмяНастройки",
		"ПримерТипаМногострочный");

КонецПроцедуры

&НаСервере
Процедура ДобавитьТестовуюТаблицуЗначений(ТаблицаНастроек)

	ТаблицаЗначенийПример = Новый ТаблицаЗначений;
	ТаблицаЗначенийПример.Колонки.Добавить("Столбец1", Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийПример.Колонки.Добавить("Столбец2", Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийПример.Колонки.Добавить("Столбец3");
	Строка = ТаблицаЗначенийПример.Добавить();
	
	Строка.Столбец1 = 1;
	Строка.Столбец2 = "Значение1";
	Строка = ТаблицаЗначенийПример.Добавить();
	Строка.Столбец1 = 2;
	Строка.Столбец2 = "Значение2";
	Строка.Столбец3 = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.ТаблицаЗначений");
	

	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("7f988333-8c73-46a8-14a6-455a55a15bbe");
	НоваяНастройка.ИмяНастройки = ИмяНастройкиТаблицаЗначений();
	НоваяНастройка.Хранилище = Новый ХранилищеЗначения(ТаблицаЗначенийПример);
	НоваяНастройка.Наименование = "Таблица значений тестовых настроек";
	НоваяНастройка.Значение = ТаблицаЗначенийПример;
	НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.ТаблицаЗначений");

КонецПроцедуры

&НаСервере
Процедура ДобавитьТестовыйКлючЗначение(ТаблицаНастроек)

	ТаблицаЗначенийПример = Новый ТаблицаЗначений;
	ТаблицаЗначенийПример.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийПример.Колонки.Добавить("Знчачение", Новый ОписаниеТипов("Строка"));
	Строка = ТаблицаЗначенийПример.Добавить();
	Строка.Ключ = "Ключ1";
	Строка.Знчачение = "Значение1";
	Строка = ТаблицаЗначенийПример.Добавить();
	Строка.Ключ = "Ключ2";
	Строка.Знчачение = "Значение2";

	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("2f111348-2c73-32a8-12a6-121a40a88bbe");
	НоваяНастройка.ИмяНастройки = ИмяНастройкиТестовыйКлючЗначение();
	НоваяНастройка.Хранилище = Новый ХранилищеЗначения(ТаблицаЗначенийПример);
	НоваяНастройка.Наименование = "Таблица значений ключ значение - тестовые ";
	НоваяНастройка.Значение = ТаблицаЗначенийПример;
	НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.КлючЗначение");

КонецПроцедуры
&НаСервере
Процедура ДобавитьТестовыйМассив(ТаблицаНастроек)

	МассивПример = Новый Массив;
	МассивПример.Добавить(1);
	МассивПример.Добавить("Два");
	МассивПример.Добавить(3.14);

	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("6f205348-2c73-46a8-98a6-851a40a12bbe");
	НоваяНастройка.ИмяНастройки = ИмяНастройкиТестовыйМассив();
	НоваяНастройка.Хранилище = Новый ХранилищеЗначения(МассивПример);
	НоваяНастройка.Значение = МассивПример;
	НоваяНастройка.Наименование = "Массив тестовых настроек";
	НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Массив");
КонецПроцедуры

// Процедура проверяет, были ли созданы предопределенные настройки.
&НаСервере
Процедура УстановитьНачальныеСтатусыПроверок()

	Элементы.НастройкиСозданы.Картинка = БиблиотекаКартинок.ОформлениеКругПустой;
	Элементы.НастройкиСозданы.Подсказка = НСтр("ru ='Проверка не производилась'");
	Элементы.НастройкиУдалены.Картинка = БиблиотекаКартинок.ОформлениеКругПустой;
	Элементы.НастройкиУдалены.Подсказка = НСтр("ru ='Проверка не производилась'");

КонецПроцедуры

// Процедура удаляет предопределенные настройки с сервера.
&НаСервере
Процедура УдалениеПредопределенныхНастроекНаСервере()

	ОбновитьПовторноИспользуемыеЗначения();
	ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();

	Для Каждого Строка Из ТаблицаНастроек Цикл
		Настройка = ПредопределенныеНастройкиПовтИсп.СсылкаПредопределеннойНастройки(Строка.ИмяНастройки);

		
		
		Если ЗначениеЗаполнено(Настройка) И ТипЗнч(Настройка) = Тип("СправочникСсылка.ПредопределенныеНастройки") Тогда
			ОбъектНастройки = Настройка.ПолучитьОбъект();
			ОбъектНастройки.Удалить();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Процедура проверяет, были ли удалены предопределенные настройки.
&НаСервере
Процедура ПроверитьУдаленныеНастройки()

	НастройкиУдалены = Истина;
	ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();

	Для Каждого Строка Из ТаблицаНастроек Цикл
		
		ИмяНастройки = Строка.ИмяНастройки;
		ТипЗначения = Строка.ТипЗначения;
		Если Не НастройкаУдалена(ИмяНастройки, ТипЗначения) Тогда
			НастройкиУдалены = Ложь;
		КонецЕсли;

	КонецЦикла;

	Если НастройкиУдалены Тогда
		Элементы.НастройкиУдалены.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
		Элементы.НастройкиУдалены.Подсказка = НСтр("ru ='Тестовые настройки не обнаружены'");
	Иначе
		Элементы.НастройкиУдалены.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
		Элементы.НастройкиУдалены.Подсказка = НСтр("ru ='Тестовые настройки найдены в базе'");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НастройкаУдалена(ИмяНастройки, ТипЗначения)
	
	Настройка = ПредопределенныеНастройки.Значение(ИмяНастройки);
	НастройкаУдалена = Настройка = ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка");
	
	ИменаКнопок = ИменаКнопокУдаленияПоТипамЗначений();
	ИмяКнопки = ИменаКнопок[ТипЗначения];
	Кнопка = Элементы[ИмяКнопки];
	Кнопка.Картинка = БиблиотекаКартинок.ОформлениеКругЖелтый;
	Кнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Кнопка.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	Команда = Команды[ИмяКнопки];
	
	Если НастройкаУдалена Тогда
			Кнопка.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
			ДобавитьПодсказку(Команда, СтрШаблон(НСтр("ru = 'Удаление настройки %1 корректно'"), ИмяНастройки));

	Иначе
			Кнопка.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
			ДобавитьПодсказку(Команда, НСтр("ru = 'Настройка не удалена'"));
		
	КонецЕсли;
	
	Возврат НастройкаУдалена;
КонецФункции


&НаСервере
Функция ИменаКнопокУдаленияПоТипамЗначений()
	Перем ИменаКнопокПоТипуНастроек;
	ИменаКнопокПоТипуНастроек = Новый Соответствие;
	
	ИменаКнопокПоТипуНастроек.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Строка"), "УдалениеПредопределеннойНастройкиСтрока");
	ИменаКнопокПоТипуНастроек.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Булево"), "УдалениеПредопределеннойНастройкиБулево");
	ИменаКнопокПоТипуНастроек.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Ссылка"), "УдалениеПредопределеннойНастройкиСсылка");
	ИменаКнопокПоТипуНастроек.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Массив"), "УдалениеПредопределеннойНастройкиМассив");
	ИменаКнопокПоТипуНастроек.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.КлючЗначение"), "УдалениеПредопределеннойНастройкиКлючЗначение");
	ИменаКнопокПоТипуНастроек.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.ТаблицаЗначений"), "УдалениеПредопределеннойНастройкиТаблицаЗначений");
	Возврат ИменаКнопокПоТипуНастроек
	
КонецФункции

&НаСервере
Процедура УдалитьНастройкуИзКоманды(ИмяНастройки)
	Перем ОбъектНастройки;
	ПредопределеннаяНастройка = ПредопределенныеНастройки.НастройкаПоИмени(ИмяНастройки);
	ОбъектНастройки = ПредопределеннаяНастройка.ПолучитьОбъект();
	ТипЗначения = ОбъектНастройки.ТипЗначения;
	ОбъектНастройки.Удалить();

	ПредопределеннаяНастройка = ПредопределенныеНастройки.НастройкаПоИмени(ИмяНастройки);
	ЗначениеПредопределеннойНастройки = ПредопределенныеНастройки.Значение(ИмяНастройки, Ложь);
	
	НастройкаУдалена(ИмяНастройки, ТипЗначения)
	
КонецПроцедуры

&НаСервере
Функция ИмяНастройкиТестовойСтрки()
	Возврат "ТестированиеСтроковогоЗначения";
КонецФункции

&НаСервере
Функция ИмяНастройкиТестовогоБулево()
	Возврат "ТестБулево";
КонецФункции

&НаСервере
Функция ИмяНастройкиТестовойСсылки()
	Возврат "ТестСсылки";
КонецФункции

&НаСервере
Функция ИмяНастройкиТестовыйМассив()
	Возврат "ТестМассива";
КонецФункции

&НаСервере
Функция ИмяНастройкиТестовыйКлючЗначение()
	Возврат "ТестКлючЗначение";
КонецФункции

&НаСервере
Функция ИмяНастройкиТаблицаЗначений()
	Возврат "ТестТаблицаЗначений";
КонецФункции

&НаСервере
Процедура СозданиеПредопределеннойНастройкиСтрокаНаСервере()

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ДобавитьТестовуюСтроку(ТаблицаНастроек);
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ПредопределеннаяНастройка = ПредопределенныеНастройки.НастройкаПоИмени(ИмяНастройкиТестовойСтрки());
	ЗначениеПредопределеннойНастройки = ПредопределенныеНастройки.Значение(ИмяНастройкиТестовойСтрки(), Истина);

КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПредопределеннойНастройкиСтрокаНаСервере()

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ДобавитьТестовуюСтроку(ТаблицаНастроек);
	ТаблицаНастроек[0].Значение = ТаблицаНастроек[0].Значение + " - 1";
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ПредопределеннаяНастройка = ПредопределенныеНастройки.НастройкаПоИмени(ИмяНастройкиТестовойСтрки());
	ЗначениеПредопределеннойНастройки = ПредопределенныеНастройки.Значение(ИмяНастройкиТестовойСтрки(), Истина);

КонецПроцедуры

&НаСервере
Процедура УдалениеПредопределеннойНастройкиСтрокаНаСервере()

	УдалитьНастройкуИзКоманды(ИмяНастройкиТестовойСтрки());

КонецПроцедуры

&НаСервере
Процедура СозданиеПредопределеннойНастройкиБулевоНаСервере()

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ДобавитьТестовоеБулево(ТаблицаНастроек);
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ЗаполнитьДанныеНаФормеПоТекущейНастрйоке(ИмяНастройкиТестовогоБулево());

КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПредопределеннойНастройкиБулевоНаСервере()

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ИзменитьТестовоеБулево(ТаблицаНастроек);
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ЗаполнитьДанныеНаФормеПоТекущейНастрйоке(ИмяНастройкиТестовогоБулево());

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНаФормеПоТекущейНастрйоке(ИмяНастройки)
	ПредопределеннаяНастройка = ПредопределенныеНастройки.НастройкаПоИмени(ИмяНастройки);
	ЗначениеПредопределеннойНастройки = ПредопределенныеНастройки.Значение(ИмяНастройки, Истина);
КонецПроцедуры

&НаСервере
Процедура УдалениеПредопределеннойНастройкиБулевоНаСервере()

	УдалитьНастройкуИзКоманды(ИмяНастройкиТестовогоБулево());

КонецПроцедуры

&НаСервере
Процедура СозданиеПредопределеннойНастройкиСсылкаНаСервере()

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ДобавитьТестовуюСсылку(ТаблицаНастроек);
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ЗаполнитьДанныеНаФормеПоТекущейНастрйоке(ИмяНастройкиТестовойСсылки());

КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПредопределеннойНастройкиСсылкаНаСервере()

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ДобавитьТестовуюСсылку(ТаблицаНастроек);
	ТаблицаНастроек[0].Значение = Справочники.ПредопределенныеНастройки.ПустаяСсылка();
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ЗаполнитьДанныеНаФормеПоТекущейНастрйоке(ИмяНастройкиТестовойСсылки());

КонецПроцедуры

&НаСервере
Процедура УдалениеПредопределеннойНастройкиСсылкаНаСервере()

	УдалитьНастройкуИзКоманды(ИмяНастройкиТестовойСсылки());

КонецПроцедуры


&НаСервере
Процедура СозданиеПредопределеннойНастройкМассивНаСервере()

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ДобавитьТестовыйМассив(ТаблицаНастроек);
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ЗаполнитьДанныеНаФормеПоТекущейНастрйоке(ИмяНастройкиТестовыйМассив());

КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПредопределеннойНастройкиМассивНаСервере()

	МассивПример = Новый Массив;
	МассивПример.Добавить(5);
	МассивПример.Добавить("Семь");
	МассивПример.Добавить(3.14);

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ДобавитьТестовыйМассив(ТаблицаНастроек);
	ТаблицаНастроек[0].Значение = МассивПример;
	ТаблицаНастроек[0].Хранилище = Новый ХранилищеЗначения(МассивПример);
	
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ЗаполнитьДанныеНаФормеПоТекущейНастрйоке(ИмяНастройкиТестовыйМассив());

КонецПроцедуры

&НаСервере
Процедура УдалениеПредопределеннойНастройкиМассивНаСервере()

	УдалитьНастройкуИзКоманды(ИмяНастройкиТестовыйМассив());

КонецПроцедуры

&НаСервере
Процедура СозданиеПредопределеннойНастройкиКлючЗначениеНаСервере()

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ДобавитьТестовыйКлючЗначение(ТаблицаНастроек);
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ЗаполнитьДанныеНаФормеПоТекущейНастрйоке(ИмяНастройкиТестовыйКлючЗначение());

КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПредопределеннойНастройкиКлючЗначениеНаСервере()

	ТаблицаЗначенийПример = Новый ТаблицаЗначений;
	ТаблицаЗначенийПример.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийПример.Колонки.Добавить("Знчачение",);
	Строка = ТаблицаЗначенийПример.Добавить();
	Строка.Ключ = "Ключ1";
	Строка.Знчачение = "Значение1";
	Строка = ТаблицаЗначенийПример.Добавить();
	Строка.Ключ = "Ключ2";
	Строка.Знчачение = "Значение2";
	Строка = ТаблицаЗначенийПример.Добавить();
	Строка.Ключ = "Ключ3";
	Строка.Знчачение = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.КлючЗначение");	

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ДобавитьТестовыйКлючЗначение(ТаблицаНастроек);
	
	ТаблицаНастроек[0].Значение = ТаблицаЗначенийПример;
	ТаблицаНастроек[0].Хранилище = Новый ХранилищеЗначения(ТаблицаЗначенийПример);
	
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ЗаполнитьДанныеНаФормеПоТекущейНастрйоке(ИмяНастройкиТестовыйКлючЗначение());

КонецПроцедуры

&НаСервере
Процедура УдалениеПредопределеннойНастройкиКлючЗначениеНаСервере()

	УдалитьНастройкуИзКоманды(ИмяНастройкиТестовыйКлючЗначение());

КонецПроцедуры

&НаСервере
Процедура СозданиеПредопределеннойНастройкиТаблицаЗначенийНаСервере()

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ДобавитьТестовуюТаблицуЗначений(ТаблицаНастроек);
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ЗаполнитьДанныеНаФормеПоТекущейНастрйоке(ИмяНастройкиТаблицаЗначений());

КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПредопределеннойНастройкиТаблицаЗначенийНаСервере()

	ТаблицаЗначенийПример = Новый ТаблицаЗначений;
	ТаблицаЗначенийПример.Колонки.Добавить("Колонка1", Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийПример.Колонки.Добавить("Колонка2",);
	ТаблицаЗначенийПример.Колонки.Добавить("Колонка3",);
	Строка = ТаблицаЗначенийПример.Добавить();
	Строка.Колонка1 = "Ключ1";
	Строка.Колонка2 = "Значение1";
	Строка.Колонка3 = "Значение1";
	
	Строка = ТаблицаЗначенийПример.Добавить();
	Строка.Колонка1 = "Ключ2";
	Строка.Колонка2 = "Значение2";
	Строка.Колонка3 = "Значение3";
	
	Строка = ТаблицаЗначенийПример.Добавить();
	Строка.Колонка1 = "Ключ3";
	Строка.Колонка2 = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.ТаблицаЗначений");	
	Строка.Колонка3 = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Строка");	

	ТаблицаНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ДобавитьТестовуюТаблицуЗначений(ТаблицаНастроек);
	
	ТаблицаНастроек[0].Значение = ТаблицаЗначенийПример;
	ТаблицаНастроек[0].Хранилище = Новый ХранилищеЗначения(ТаблицаЗначенийПример);
	
	ПредопределенныеНастройки.ОбновитьНастройкиВБазе(ТаблицаНастроек);

	ЗаполнитьДанныеНаФормеПоТекущейНастрйоке(ИмяНастройкиТаблицаЗначений());

КонецПроцедуры

&НаСервере
Процедура УдалениеПредопределеннойНастройкиТаблицаЗначенийНаСервере()
	
	УдалитьНастройкуИзКоманды(ИмяНастройкиТаблицаЗначений());

КонецПроцедуры

#КонецОбласти