Функция Значение(ИмяНастройки, ВызыватьИсключение = Ложь) Экспорт
	
	Возврат ПредопределенныеНастройкиПовтИсп.Значение(ИмяНастройки, ВызыватьИсключение);
	
КонецФункции

Функция РезультатЗначениеИзЗапроса(ИмяНастройки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПредопределенныеНастройки.Параметр КАК Параметр,
	|	ПредопределенныеНастройки.МногострочныйПараметр КАК МногострочныйПараметр,
	|	ПредопределенныеНастройки.СоставнойПараметр КАК СоставнойПараметр,
	|	ПредопределенныеНастройки.Хранилище КАК Хранилище
	|ИЗ
	|	Справочник.ПредопределенныеНастройки КАК ПредопределенныеНастройки
	|ГДЕ
	|	ПредопределенныеНастройки.Ссылка = &Ссылка
	|	И ПредопределенныеНастройки.МногострочныйПараметр = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредопределенныеНастройки.Значение,
	|	ПредопределенныеНастройки.Ссылка.МногострочныйПараметр,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.ПредопределенныеНастройки.Параметры КАК ПредопределенныеНастройки
	|ГДЕ
	|	ПредопределенныеНастройки.Ссылка = &Ссылка
	|	И ПредопределенныеНастройки.Ссылка.МногострочныйПараметр = ИСТИНА";
	

	Ссылка = ПредопределенныеНастройкиПовтИсп.СсылкаПредопределенногоЭлемента(ИмяНастройки);

	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Попытка
		
		РезультатЗначение = Запрос.Выполнить();
		
	Исключение
			
			Сообщение = БазоваяФункциональностьКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru ='Передано отсутствующее наименование предопределенной настройки ""%1""'"),
				ИмяНастройки);
			ВызватьИсключение Сообщение;
			
	КонецПопытки;
	
	Возврат РезультатЗначение;
	
КонецФункции