Функция Значение(ИмяНастройки, ВызыватьИсключение = Ложь) Экспорт
	
	//УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗначение = ПредопределенныеНастройки.ЗначениеПредопределеннойНастройки(ИмяНастройки, ВызыватьИсключение);
	
	Если РезультатЗначение = ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка") Тогда
		Возврат РезультатДляОтсутствующейНастройки(ИмяНастройки, ВызыватьИсключение);
	ИначеЕсли РезультатЗначение = Неопределено Тогда
		Возврат РезультатДляОтсутствующейНастройки(ИмяНастройки, ВызыватьИсключение);
	КонецЕсли;
	
	Возврат РезультатЗначение;
	
КонецФункции

Функция СсылкаПредопределеннойНастройки(ИмяНастройки) Экспорт
	
	Возврат Справочники.ПредопределенныеНастройки.НайтиПоРеквизиту("ИмяНастройки", ИмяНастройки);
	
КонецФункции

Функция РезультатДляОтсутствующейНастройки(ИмяНастройки, ВызыватьИсключение) Экспорт
		
			Если ВызыватьИсключение Тогда
				Сообщение = БазоваяФункциональностьКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru ='Настройка с именем ""%1"" не найдена.'"),
					ИмяНастройки);
				ВызватьИсключение Сообщение;
			Иначе
				Возврат ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка");
			КонецЕсли;
		
КонецФункции





