#Область СлужебныйПрограммныйИнтерфейс

Функция Значение(ИмяНастройки, ВызыватьИсключение = Ложь) Экспорт
	
	//УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗначение = ПредопределенныеНастройки.ЗначениеПредопределеннойНастройки(ИмяНастройки, ВызыватьИсключение);
	
	Если РезультатЗначение = ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка") Тогда
		Возврат ПредопределенныеНастройки.РезультатДляОтсутствующейНастройки(ИмяНастройки, ВызыватьИсключение);
	ИначеЕсли РезультатЗначение = Неопределено Тогда
		Возврат ПредопределенныеНастройки.РезультатДляОтсутствующейНастройки(ИмяНастройки, ВызыватьИсключение);
	КонецЕсли;
	
	Возврат РезультатЗначение;
	
КонецФункции

Функция СсылкаПредопределеннойНастройки(ИмяНастройки) Экспорт
	
	Возврат Справочники.ПредопределенныеНастройки.НайтиПоРеквизиту("ИмяНастройки", ИмяНастройки);
	
КонецФункции

#КонецОбласти







