#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значение предопределенной настройки по ее имени.
//
// Параметры:
//   ИмяНастройки - Строка - имя предопределенной настройки
//   ВызыватьИсключение - Булево - признак вызова исключения при отсутствии настройки
//
// Возвращаемое значение:
//   Произвольный - значение предопределенной настройки или результат для отсутствующей настройки
Функция Значение(ИмяНастройки, ВызыватьИсключение = Ложь) Экспорт
	
	РезультатЗначение = ПредопределенныеНастройки.ЗначениеПредопределеннойНастройкиПоИмени(ИмяНастройки, ВызыватьИсключение);
	
	Если РезультатЗначение = ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка") Тогда
		Возврат ПредопределенныеНастройки.РезультатДляОтсутствующейНастройки(ИмяНастройки, ВызыватьИсключение);
	ИначеЕсли РезультатЗначение = Неопределено Тогда
		Возврат ПредопределенныеНастройки.РезультатДляОтсутствующейНастройки(ИмяНастройки, ВызыватьИсключение);
	КонецЕсли;
	
	Возврат РезультатЗначение;
	
КонецФункции

// Возвращает ссылку на предопределенную настройку по ее имени.
//
// Параметры:
//   ИмяНастройки - Строка - имя предопределенной настройки
//
// Возвращаемое значение:
//   СправочникСсылка.ПредопределенныеНастройки, Неопределено - ссылка на найденную предопределенную настройку или Неопределено, если настройка не найдена
Функция СсылкаПредопределеннойНастройки(ИмяНастройки) Экспорт
	
	Возврат Справочники.ПредопределенныеНастройки.НайтиПоРеквизиту("ИмяНастройки", ИмяНастройки);
	
КонецФункции

#КонецОбласти
