Функция Значение(ПараметрНастройка, ВызыватьИсключение = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СсылкаПредопределенногоЗначения = СсылкаПоИмениНастройки(ПараметрНастройка);
	
	РезультатЗначение = РезультатЗначениеИзЗапроса(ПараметрНастройка);
	
	Если РезультатЗначение.Пустой() Тогда
		Возврат РезультатДляНезаполненногоЗначения(ПараметрНастройка, ВызыватьИсключение);;
	КонецЕсли;
	
	ВыборкаЗначение = РезультатЗначение.Выбрать();
	ВыборкаЗначение.Следующий();
	
	ЗначениеЗаполнено = Ложь;
	
	Если ВыборкаЗначение.МногострочныйПараметр Тогда
		
		Результат = Новый Массив;
		Результат.Добавить(ВыборкаЗначение.Параметр);
		
		Пока ВыборкаЗначение.Следующий() Цикл
			Результат.Добавить(ВыборкаЗначение.Параметр);
		КонецЦикла;		
		
		ЗначениеЗаполнено = Результат.Количество() <> 0;
		
	ИначеЕсли ВыборкаЗначение.СоставнойПараметр Тогда
		
		Результат = ВыборкаЗначение.Хранилище.Получить();
		ЗначениеЗаполнено = Результат <> Неопределено;
		
	Иначе
		
		Результат = ВыборкаЗначение.Параметр;
		ЗначениеЗаполнено = Результат <> Неопределено;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено Тогда
		
		Результат = РезультатДляНезаполненногоЗначения(ПараметрНастройка, ВызыватьИсключение);
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаПоИмениНастройки(ИмяНастройки) Экспорт
	
КонецФункции

Функция СсылкаПредопределенногоЭлемента(ИмяПредопределенного) Экспорт
	
	Ссылка = СсылкаПоИмениНастройки(ИмяПредопределенного);
	
	Если Ссылка = Неопределено Тогда
		Ссылка = ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка");
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

