#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;

	Если ТипЗначения = Перечисления.ТипыЗначенияПредопределенныхЗначений.Массив Тогда
		
		МассивЗначение = Хранилище.Получить();
		Если ТипЗнч(МассивЗначение) = Тип("Массив") Тогда
			ПредставлениеМассива = СтрСоединить(МассивЗначение, ", ");
			ПредставлениеЗначения = СтрШаблон(НСтр("ru = 'Массив[%1]'"), ПредставлениеМассива);
		КонецЕсли;
		
	ИначеЕсли ТипЗначения = Перечисления.ТипыЗначенияПредопределенныхЗначений.ТаблицаЗначений Тогда
		
		ТаблицаЗначенийНастройки =  Хранилище.Получить();
		Если ТипЗнч(ТаблицаЗначенийНастройки) = Тип("ТаблицаЗначений") Тогда			
			МассивИменКолонок = Новый Массив;
			Для Каждого Колонка Из ТаблицаЗначенийНастройки.Колонки Цикл
				МассивИменКолонок.Добавить(Колонка.Имя);
			КонецЦикла;
			
			ПредставлениеТаблицы = СтрСоединить(МассивИменКолонок, ", ");
			ПредставлениеЗначения = СтрШаблон(НСтр("ru = 'Таблица значений[%1]'"), ПредставлениеТаблицы);
		КонецЕсли;
		
	ИначеЕсли ТипЗначения = Перечисления.ТипыЗначенияПредопределенныхЗначений.КлючЗначение Тогда
		
		ТаблицаЗначенийНастройки =  Хранилище.Получить();
		Если ТипЗнч(ТаблицаЗначенийНастройки) = Тип("ТаблицаЗначений") Тогда
			ПредставлениеТаблицы = СтрСоединить(ТаблицаЗначенийНастройки.ВыгрузитьКолонку("Ключ"), ", ");
			ПредставлениеЗначения = СтрШаблон(НСтр("ru = 'Ключ и значение[%1]'"), ПредставлениеТаблицы);
		КонецЕсли;	
		
	ИначеЕсли ЭтоГруппа Тогда 
		ПредставлениеЗначения = СокрЛП(Наименование);
	Иначе
		ПредставлениеЗначения = СокрЛП(Значение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

