
#Область ПрограммныйИнтерфейс


// Процедура заполняет таблицу предопределенных настроек значением версии подсистемы.
//
// Параметры:
// ТаблицаНастроек - ТаблицаЗначений, в которую будут добавляться предопределенные настройки.
//
Процедура ПриЗаполненииТаблицыПредопределенныхНастроек(ТаблицаНастроек) Экспорт
    
    НоваяНастройка = ТаблицаНастроек.Добавить();
    НоваяНастройка.Идентификатор = "ВерсияПодсистемыПредопределенныхНастроек";
    НоваяНастройка.ИмяНастройки = "ВерсияПодсистемыПредопределенныхНастроек";
    НоваяНастройка.МногострочныйПараметр = Ложь;
    НоваяНастройка.ЗначенияПараметров = "1.01";
    	
КонецПроцедуры

#КонецОбласти