#Область ПрограммныйИнтерфейс

// Процедура заполняет таблицу предопределенных настроек значением версии подсистемы.
//
// Параметры:
// 	ТаблицаНастроек - ТаблицаЗначений - Таблица в которую будут добавляться предопределенные настройки.
//
Процедура ПриЗаполненииТаблицыПредопределенныхНастроек(ТаблицаНастроек) Экспорт
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ВерсияПодсистемы";
	НоваяНастройка.ИмяНастройки	= "Версия подсистемы";
	НоваяНастройка.МногострочныйПараметр	= Ложь;
	НоваяНастройка.ЗначенияПараметров	= "1.0.0";
	
КонецПроцедуры

#КонецОбласти