#Область ПрограммныйИнтерфейс

// Процедура заполняет таблицу предопределенных настроек значением версии подсистемы.
//
// Параметры:
// 	ТаблицаНастроек - ТаблицаЗначений - Таблица в которую будут добавляться предопределенные настройки.
//
Процедура ПриЗаполненииТаблицыПредопределенныхНастроек(ТаблицаНастроек) Экспорт
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("87548614-5423-299a-af9c-a08e5ca86056");;
	НоваяНастройка.Наименование = НСтр("ru ='Версия подсистемы'");
	НоваяНастройка.ИмяНастройки	= "ВерсияПодсистемы";
	НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Строка");
	НоваяНастройка.Описание = НСтр("ru ='Информация о версии текущей подсистемы.'");
	НоваяНастройка.Значение	= "1.0.0";

	
КонецПроцедуры

#КонецОбласти