
&НаСервере
Процедура ПроверкаПолученияЗначенийНаСервере()

	Версия = ПредопределенныеНастройки.Значение("ВерсияПодсистемы");
	Сообщить(Версия); // "1.0.0"

	// Получение булевой настройки
	Если ПредопределенныеНастройки.Значение("ВключеноРегистрирование") Тогда
		Сообщить(ПредопределенныеНастройки.Значение("ВключеноРегистрирование"));
	КонецЕсли;

	// Получение массива
	РазрешенныеПользователи = ПредопределенныеНастройки.Значение("РазрешенныеПользователи");
	Для Каждого Пользователь Из РазрешенныеПользователи Цикл
		Сообщить(Пользователь);
	КонецЦикла;

	Сообщить(ПредопределенныеНастройки.Значение("URL_API"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПолученияЗначений(Команда)
	ПроверкаПолученияЗначенийНаСервере();
КонецПроцедуры
