
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОтобразитьСоставнойПараметр();
	ОтобразитьПараметрБулево();
	ЗаполнитьИсходноеЗначение();
	УстановитьВидимостьЭлементовФормы();
	УстановитьОформлениеЭлементаОтображенияЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПереключитьСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если Не Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Булево") 
		 И Не Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Дата")
		 И Не Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Строка")
		 И Не Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Ссылка") Тогда
		ТекущийОбъект.Значение = Неопределено;
	КонецЕсли;
	
	Если Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.КлючЗначение") Тогда
		ПередЗаписьюНаСервереСоставнойПараметр(ТекущийОбъект);
	КонецЕсли;
	
	Если Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Массив") Тогда
		
		ПользовательскиеЗначения = СписокМассив.ВыгрузитьЗначения();
		ТекущийОбъект.Хранилище = Новый ХранилищеЗначения(ПользовательскиеЗначения);
		
	КонецЕсли;

	Если Объект.ТипЗначения <> ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.ТаблицаЗначений")
	И Объект.ТипЗначения <> ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Массив")
	И Объект.ТипЗначения <> ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.КлючЗначение") Тогда
		ТекущийОбъект.Хранилище = Новый ХранилищеЗначения(Неопределено);
		ТаблицаПараметры.Очистить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеБулевоПриИзменении(Элемент)

	Объект.Значение = ЗначениеБулево;

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПередЗаписьюНаСервереСоставнойПараметр(ТекущийОбъект)
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		СтруктураХранилищаРанее = Новый Структура;
	Иначе
		СтруктураХранилищаРанее = ПредопределенныеНастройки.ЗначениеПредопределеннойНастройки(ТекущийОбъект.Ссылка);
	КонецЕсли;
	
	СтруктураХранилища = Новый Структура;
	Для Каждого ЭлементСписка Из ТаблицаПараметры Цикл
		
		ЗначениеРанее = Неопределено;
		
		СтруктураХранилищаРанее.Свойство(ЭлементСписка.Наименование, ЗначениеРанее);
		
		Если ТипЗнч(ЗначениеРанее) = Тип("ТаблицаЗначений") Тогда
			СтруктураХранилища.Вставить(ЭлементСписка.Наименование, ЗначениеРанее);
			
		Иначе
			СтруктураХранилища.Вставить(ЭлементСписка.Наименование, ЭлементСписка.Значение);
		КонецЕсли; 
		
	КонецЦикла;
	
	ТекущийОбъект.Хранилище = Новый ХранилищеЗначения(СтруктураХранилища, Новый СжатиеДанных());
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницу()
	
	Если Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Булево") Тогда
		НоваяСтраница = Элементы.СтраницаЗначениеБулево;
		
	ИначеЕсли Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Строка") Тогда
		НоваяСтраница = Элементы.СтраницаСтрока;
		
	ИначеЕсли Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Ссылка") Тогда
		НоваяСтраница = Элементы.СтраницаПараметр;
		
	ИначеЕсли Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Массив") Тогда
		НоваяСтраница = Элементы.СтраницаМассив;
		
	ИначеЕсли Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.КлючЗначение") Тогда
		НоваяСтраница = Элементы.СтраницаСоставной;
		
	ИначеЕсли Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Дата") Тогда
		НоваяСтраница = Элементы.СтраницаПараметр;
		
	ИначеЕсли Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.ТаблицаЗначений") Тогда
		НоваяСтраница = Элементы.СтраницаСоставной;

	Иначе
		НоваяСтраница = Элементы.СтраницаПараметр;
	КонецЕсли;
	
	
	Если Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Булево") Тогда
		// Ничего не надо
	ИначеЕсли Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Строка") Тогда
		
		ДоступныеТипы = Новый Массив;
		ДоступныеТипы.Добавить("Строка");
		Элементы.ЗначениеСтрока.ОграничениеТипа = Новый ОписаниеТипов(ДоступныеТипы);
		
	ИначеЕсли Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Ссылка") Тогда
		
		//Элементы.Значение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПредопределенныеНастройки");
	
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница <> НоваяСтраница Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = НоваяСтраница;
	КонецЕсли;
	
	Для Каждого Элемент Из Элементы.ГруппаСтраницы.ПодчиненныеЭлементы Цикл
		Если Элемент = НоваяСтраница Тогда
			Элемент.Видимость = Истина;
		Иначе
			Элемент.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСоставнойПараметр()
	
	ОбъектОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеХранилища = ОбъектОбъект.Хранилище.Получить();
	
	Если Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.ТаблицаЗначений") Тогда

		
		ЭтоТаблицаЗначений = Истина;
		ОтобразитьТаблицуЗначения(ЗначениеХранилища);
		
	ИначеЕсли Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.КлючЗначение") Тогда
		
		ОтобразитьТаблицуЗначения(ЗначениеХранилища);
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ОтобразитьТаблицуЗначения(ЗначениеХранилища)
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТаблицаНастройки", Новый ОписаниеТипов("ТаблицаЗначений")));
	
	Для Каждого Колонка Из ЗначениеХранилища.Колонки Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаНастройки", Колонка.Заголовок));
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, Новый Массив);
	
	Элементы.ТаблицаПараметры.Видимость = Ложь;
	
	ТаблицаФормы = Элементы.Добавить("ТаблицаНастройки", Тип("ТаблицаФормы"), Элементы.СтраницаСоставной);
	ТаблицаФормы.ПутьКДанным = "ТаблицаНастройки";
	
	Для Каждого Колонка Из ЗначениеХранилища.Колонки Цикл
		ПолеВвода = Элементы.Добавить("ТаблицаНастройки" + Колонка.Имя, Тип("ПолеФормы"), Элементы.ТаблицаНастройки);
		ПолеВвода.Вид		  = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "ТаблицаНастройки." + Колонка.Имя;

	КонецЦикла;
	
	Для Каждого СтрокаХранилища Из ЗначениеХранилища Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.ТаблицаНастройки.Добавить(), СтрокаХранилища);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьПараметрБулево()
	
	Если ТипЗнч(Объект.Значение) = Тип("Булево") Тогда
		Элементы.ЗначениеБулево.Заголовок = Объект.Наименование;
		ЗначениеБулево = Объект.Значение
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеЭлементаОтображенияЗначения()
	
	Если Объект.ТипЗначения = Перечисления.ТипыЗначенияПредопределенныхЗначений.Массив Тогда
		
		ХранилищеЗначений = РеквизитФормыВЗначение("Объект").Хранилище;
		МассивЗначений = ХранилищеЗначений.Получить();
		Если ТипЗнч(МассивЗначений) = Тип("Массив") Тогда
			Для Каждого Элемент Из МассивЗначений Цикл
				СписокМассив.Добавить(Элемент);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсходноеЗначение()
	
	Ссылка = Объект.Ссылка;
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОписанияПредопределенныхНастроек = ПредопределенныеНастройки.НоваяТаблицаПредопределенныхНастроек();
	ПредопределенныеНастройки.ИнициализироватьТаблицуПредопределенныхНастроек(ТаблицаОписанияПредопределенныхНастроек);
	
	СтрокаТекущейНастройки = ТаблицаОписанияПредопределенныхНастроек.Найти(Объект.ИмяНастройки, "ИмяНастройки");
	Если СтрокаТекущейНастройки = Неопределено Тогда
		Возврат;
	Иначе
		ИсходноеЗначение = СтрокаТекущейНастройки.Значение;
		СозданПрограммно = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Если СозданПрограммно Тогда
		Элементы.ГруппаПредупреждение.Видимость = Ложь;
		ЗначенияРазличаются = (Объект.Значение <> ИсходноеЗначение);
		Элементы.ГруппаИнформация.Видимость = ЗначенияРазличаются;
	Иначе
		Элементы.ГруппаПредупреждение.Видимость = Истина;
		Элементы.ГруппаИнформация.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
